# Задание: Площадь и периметр прямоугольника
a = float(input("Введите длину первой стороны прямоугольника: "))
b = float(input("Введите длину второй стороны прямоугольника: "))
area = a * b
perimeter = 2 * (a + b)
print("Площадь прямоугольника:", area)
print("Периметр прямоугольника:", perimeter)